

#توضیح راه‌حل:
'''
ابتدا، دو رشته را از ورودی دریافت می‌کنیم و هر دو را به حروف کوچک تبدیل می‌کنیم تا مقایسه به حروف کوچک و بزرگ حساس نباشد.
سپس، با استفاده از عملگرهای مقایسه، بررسی می‌کنیم که آیا رشته اول از رشته دوم کوچکتر است یا برعکس.
اگر رشته اول کوچکتر باشد، عدد -1 را چاپ می‌کنیم. اگر بزرگتر باشد، عدد 1 را چاپ می‌کنیم. و اگر مساوی باشند، عدد 0 را چاپ می‌کنیم.

'''



first_str = input().strip().lower()
second_str = input().strip().lower()

if first_str < second_str:
    print("-1")
elif second_str < first_str:
    print("1")
else:
    print("0")
